In [10]:
import pandas as pd

It is common to create a dataframe from a dictionary

In [11]:
data = {
  'city': ['Brooklyn', 'Seoul', 'Barcelona', 'Mexico City'],
  'country': ['US', 'South Korea', 'Spain', 'Mexico'],
  'population': [2646000, 9411000, 1636000, 9209944]
}

df = pd.DataFrame(data)

In [12]:
df

          city      country  population
0     Brooklyn           US     2646000
1        Seoul  South Korea     9411000
2    Barcelona        Spain     1636000
3  Mexico City       Mexico     9209944

Or we could do it directly using rows

In [13]:
data = [
  ['Brooklyn', 'US', 2646000],
  ['Seoul', 'South Korea', 9411000],
  ['Barcelona', 'Spain', 1636000],
  ['Mexico City', 'Mexico', 9209944]
]

df = pd.DataFrame(data, columns=['city', 'country', 'population'])

In [14]:
df

          city      country  population
0     Brooklyn           US     2646000
1        Seoul  South Korea     9411000
2    Barcelona        Spain     1636000
3  Mexico City       Mexico     9209944

In [ ]:
contacts = {
    'name': ['Bart', 'Lisa', 'Homer', 'Marge'],
    'age': [10, 8, 39, 36],
    'phone': ['555-1234', '555-5678', '555-8765', '555-4321'],
    'astrological_sign': ['Taurus', 'Virgo', 'Taurus', 'Pisces']
}
contacts_df = pd.DataFrame(contacts)
contacts_df

    name  age phone astrological_sign
0   Bart   10                  Taurus
1   Lisa    8                   Virgo
2  Homer   39                  Taurus
3  Marge   36                  Pisces

In [16]:
contacts = [
  ['Bart', 10, '555-1234', 'Taurus'],
  ['Lisa', 8, '555-5678', 'Virgo'],
  ['Homer', 39, '555-8765', 'Taurus'],
  ['Marge', 36, '555-4321', 'Pisces'],
]
contacts_df = pd.DataFrame(contacts, columns=['name', 'age', 'phone', 'astrological_sign'])
contacts_df

    name  age     phone astrological_sign
0   Bart   10  555-1234            Taurus
1   Lisa    8  555-5678             Virgo
2  Homer   39  555-8765            Taurus
3  Marge   36  555-4321            Pisces